Tekla Open API Reference for Tekla Structures 2025
ContourPlate Properties
The ContourPlate type exposes the following members.
Properties
Name | Description
AssemblyNumber
 Gets or sets the assembly number. Defines the numbering in the assembly sense.
 (Inherited from Part.)
CastUnitType
 Gets or sets the cast unit type of the part.
 (Inherited from Part.)
Class
 Gets or sets the class of the part.
 (Inherited from Part.)
Contour
 Gets or sets the contour for the contour plate.
DeformingData
 Gets or sets the deforming data of the part.
 (Inherited from Part.)
Finish
 Gets or sets the finish of the part.
 (Inherited from Part.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Material
 Gets or sets the material the part is made of.
 (Inherited from Part.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the part.
 (Inherited from Part.)
PartNumber
 Gets or sets the part number. Defines the numbering in the part sense.
 (Inherited from Part.)
Position
 Gets or sets the part position. Defines the way the part is positioned in the model.
 (Inherited from Part.)
PourPhase
 Gets or sets the pour phase of the part.
 (Inherited from Part.)
Profile
 Gets or sets the profile of the part.
 (Inherited from Part.)
Type
 Gets the read only type of the contour plate. In creation, the type is defined based on the material. If the material is concrete, the type will be slab, otherwise plate.
Top
See Also
Reference
ContourPlate Class
Tekla.Structures.Model Namespace